Host/notes.xml

<root>
<!--added data contract to server but did not update svc ref on client-->
<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
<s:Header>
<a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</a:Action>
<a:MessageID>urn:uuid:78aa637d-6a80-4f96-bb94-d70926b202b9</a:MessageID>
<a:ReplyTo>
<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
</a:ReplyTo>
<a:To s:mustUnderstand="1">net.tcp://localhost:9000/GigManagerService</a:To>
</s:Header>
<s:Body>
<SaveGig xmlns="http://www.thatindigogirl.com/samples/2006/06">
<item xmlns:b="http://schemas.datacontract.org/2004/07/ContentTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
<b:DateEnd>2009-11-01T05:30:00</b:DateEnd>
<b:DateStart>2009-10-31T22:30:00</b:DateStart>
<b:Description>some desc</b:Description>
<b:Id>0</b:Id>
<b:Title>some boring event</b:Title>
<b:Url>http://askfdj.com</b:Url>
</item>
</SaveGig>
</s:Body>
</s:Envelope>

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
<s:Header>
<a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action>
</s:Header>
<s:Body>
<SaveGigResponse xmlns="http://www.thatindigogirl.com/samples/2006/06"></SaveGigResponse>
</s:Body>
</s:Envelope>
<!--
SaveGig called with title=
desc=
url=
start=01/01/01 12:00:00 AM
end=01/01/01 12:00:00 AM
-->
</root>